# Py City Schools (Homework 4)

[Link](http://usc.bootcampcontent.com/usc-boot-camp/USCLOS201710DATA5-Class-Repository-DATA/tree/master/Pandas/Homework%20Instructions/Instructions) to homework assignment.

### List of observations From Analysis

First. Based on the table presented at line 50, while District school have a higher budget per students (normalized budget), the overall reading or math passing rate is about 22% lower than the charter schools.  This observation is interesting since it challenges the notion that 'throwing' more money at any problem can solve the problem. One [NYT Article](https://www.nytimes.com/2016/12/12/nyregion/it-turns-out-spending-more-probably-does-improve-education.html) suggest that spending more can improve education.

Second. Math scores between District and charter schools see about a 27% gap with their students, where as the reading scores see about a 16% gap.  These data suggest that students at District schools, even with their higher per student budgets, have a harder time acheiving passing math scores. In addition, from looking at lines 36 and 37, the scores seem to be constant across each grade level which suggest that the lower math scores seen for District schools are consistantly lower across all grade levels.

Third. The size of school also seems to have an impact on the outcome of test scores which is also observed by folks at [UC Davis](https://poverty.ucdavis.edu/policy-brief/small-class-sizes-yield-higher-test-scores-among-young-children).  From the data shown in line 48, smaller schools shows 20% increase in the amount of students who pass math or reading when compared to larger schools.

In [1]:
#Standard imports

import pandas as pd
import numpy as np

In [2]:
#Refernce paths for data files

file1 = '/Users/gta/dev/hw-4/schools_complete.csv'
file2 = '/Users/gta/dev/hw-4/students_complete.csv'

In [3]:
#Read in csv file into two dataframes

df_schools = pd.read_csv(file1)
df_students = pd.read_csv(file2)

In [4]:
#Display head of df_schools

df_schools.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
#Display shape of df_schools

df_schools.shape

(15, 5)

In [6]:
#Review summary stats for the data set

df_schools.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [7]:
#Display head of df_students

df_students.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [8]:
#Define functions that determine if the student received a passing score

def passing_reading(c):
    if c['reading_score'] > 69:
        return 1
    else:
        return 0

def passing_math(c):
    if c['math_score'] > 69:
        return 1
    else:
        return 0

In [9]:
#Apply functions to create new columns in dataframe 

df_students['passing_reading'] = df_students.apply(passing_reading, axis = 1) 
df_students['passing_math'] = df_students.apply(passing_math, axis=1)
df_students.head()

,Student ID,name,gender,grade,school,reading_score,math_score,passing_reading,passing_math
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,1
1,1,Victor Smith,M,12th,Huang High School,94,61,1,0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,1,0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,0
4,4,Bonnie Ray,F,9th,Huang High School,97,84,1,1

In [10]:
#Display shape of df_students

df_students.shape

(39170, 9)

In [11]:
#Review column names in dataframe

df_students.columns

Index(['Student ID', 'name', 'gender', 'grade', 'school', 'reading_score',
       'math_score', 'passing_reading', 'passing_math'],
      dtype='object')

In [12]:
#Review summary stats for the data set

df_students.describe()

,Student ID,reading_score,math_score,passing_reading,passing_math
count,39170.000000,39170.00000,39170.000000,39170.000000,39170.000000
mean,19584.500000,81.87784,78.985371,0.858055,0.749809
std,11307.549359,10.23958,12.309968,0.348999,0.433129
min,0.000000,63.00000,55.000000,0.000000,0.000000
25%,9792.250000,73.00000,69.000000,1.000000,0.000000
50%,19584.500000,82.00000,79.000000,1.000000,1.000000
75%,29376.750000,91.00000,89.000000,1.000000,1.000000
max,39169.000000,99.00000,99.000000,1.000000,1.000000

### District Summary Data Frame Approach (Deliverable 1)

In [13]:
#Calculate total number of schools

total_schools = len(df_schools['name'])
total_schools

15

In [14]:
#Calculate total number of students

total_students = sum(df_schools['size'])
total_students

39170

In [15]:
#Calculate total budget

total_budget = sum(df_schools['budget'])
total_budget

24649428

In [16]:
#Calculate average math score

average_math_score = df_students['math_score'].mean()
average_math_score

78.98537145774827

In [17]:
#Calculate average reading score

average_reading_score = df_students['reading_score'].mean()
average_reading_score

81.87784018381414

In [18]:
#Determine number of students with a passing math score (assume that a passing math score is >69)

total_students_with_passing_math_score = len(df_students.loc[df_students['math_score'] > 69])
total_students_with_passing_math_score

29370

In [19]:
#Determine percent of students with a passing math score (assume that a passing math score is >69)

pct_passing_math_score = 100 * (total_students_with_passing_math_score / total_students)
pct_passing_math_score

74.980852693387803

In [20]:
#Determine number of students with a passing reading score (assume that a passing reading score is >69)

total_students_with_passing_reading_score = len(df_students.loc[df_students['reading_score'] > 69])
total_students_with_passing_reading_score

33610

In [21]:
#Determine percent of students with a passing reading score (assume that a passing reading score is >69)

pct_passing_reading_score = 100 * (total_students_with_passing_reading_score / total_students)
pct_passing_reading_score

85.805463364820014

In [22]:
#Determine overall percentage of students who received a passing score (assume passing score is > 69)

overall_pct_passing = (pct_passing_math_score + pct_passing_reading_score) / 2
overall_pct_passing

80.393158029103915

### District Summary Data Frame (Deliverable 1)

In [23]:
#Take calculated values and send them to a dataframe

summary_df1 = pd.DataFrame([{   'Total Schools':total_schools,
                                'Total Students':total_students,
                                'Total Budget': total_budget,
                                'Average Math Score': average_math_score,
                                'Average Reading Score': average_reading_score,
                                '% Passing Math': pct_passing_math_score,
                                '% Passing Reading': pct_passing_reading_score,
                                '% Overall Passing Rate': overall_pct_passing
                            
                           }])
summary_df1

,% Overall Passing Rate,% Passing Math,% Passing Reading,Average Math Score,Average Reading Score,Total Budget,Total Schools,Total Students
0,80.393158,74.980853,85.805463,78.985371,81.87784,24649428,15,39170

### School Summary

Create an overview table that summarizes key metrics about each school, including:

In [24]:
#In order to do an inner join, there must be a common key in both datasets.  Base the common key off of the school name.
#This cell changes the name of the school column so that the inner join can be completed 

df_students1 = df_students.rename(columns={'school':'school_name'})
df_students1.head()

,Student ID,name,gender,grade,school_name,reading_score,math_score,passing_reading,passing_math
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,1
1,1,Victor Smith,M,12th,Huang High School,94,61,1,0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,1,0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,0
4,4,Bonnie Ray,F,9th,Huang High School,97,84,1,1

In [25]:
#In order to do an inner join, there must be a common key in both datasets.  Base the common key off of the school name.
#This cell changes the name of the school column so that the inner join can be completed .

df_schoo11 = df_schools.rename(columns={'name':'school_name'})
df_schoo11.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [26]:
#Complete the inner join of the school and students dataframes to reutrn a combined (merged) dataframe.
#Drop the School ID and Student ID columns to reduce the columns in the merged dataframe for readability

df_merge = pd.merge(df_schoo11, df_students1, on='school_name')
df_merge.drop(['School ID', 'Student ID'], axis = 1, inplace=True)

In [27]:
#Review all column names from dataframe once the drop has occured

df_merge.columns

Index(['school_name', 'type', 'size', 'budget', 'name', 'gender', 'grade',
       'reading_score', 'math_score', 'passing_reading', 'passing_math'],
      dtype='object')

In [28]:
#Review resulting dataframe without the additional columns

df_merge.head()

,school_name,type,size,budget,name,gender,grade,reading_score,math_score,passing_reading,passing_math
0,Huang High School,District,2917,1910635,Paul Bradley,M,9th,66,79,0,1
1,Huang High School,District,2917,1910635,Victor Smith,M,12th,94,61,1,0
2,Huang High School,District,2917,1910635,Kevin Rodriguez,M,12th,90,60,1,0
3,Huang High School,District,2917,1910635,Dr. Richard Scott,M,12th,67,58,0,0
4,Huang High School,District,2917,1910635,Bonnie Ray,F,9th,97,84,1,1

In [29]:
#Define a dictionary with the numpy functions needed for the groupby that will be completed in the next step.

agg_function = {'budget':np.mean, 'reading_score':np.mean, 'math_score': np.mean, 'size': np.mean, 'passing_reading': np.sum, 'passing_math': np.sum}

In [30]:
#Join the data frames and create a new column that determines the amount of money allocated per student

#Complete a groupby of the merged dataframe and apply certain (different) numpy functions to the columns
df_grouped = df_merge.groupby(df_merge['school_name'], as_index=False).agg(agg_function)

#Define the budget per student column based on the budget of each school and the number of students at each school.
df_grouped['Per_Student_Budget'] = df_grouped['budget'] / df_grouped['size']

#Define the column that calcualtes the percent of students that pass math at each school.
df_grouped['Pct_Passing_Math'] = 100 * (df_grouped['passing_math'] / df_grouped['size']) 

#Define the column that calcualtes the percent of students that pass reading at each school.
df_grouped['Pct_Passing_Reading'] = 100 * (df_grouped['passing_reading'] / df_grouped['size']) 

#Define the column that calcualtes the percent of students that pass math and reading at each school.
df_grouped['Pct_Passing_Overall'] = (df_grouped['Pct_Passing_Reading'] + df_grouped['Pct_Passing_Math']) / 2

#Return the new dataframe.
df_grouped

,school_name,budget,reading_score,math_score,size,passing_reading,passing_math,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall
0,Bailey High School,3124928,81.033963,77.048432,4976,4077,3318,628.0,66.680064,81.933280,74.306672
1,Cabrera High School,1081356,83.975780,83.061895,1858,1803,1749,582.0,94.133477,97.039828,95.586652
2,Figueroa High School,1884411,81.158020,76.711767,2949,2381,1946,639.0,65.988471,80.739234,73.363852
3,Ford High School,1763916,80.746258,77.102592,2739,2172,1871,644.0,68.309602,79.299014,73.804308
4,Griffin High School,917500,83.816757,83.351499,1468,1426,1371,625.0,93.392371,97.138965,95.265668
5,Hernandez High School,3022020,80.934412,77.289752,4635,3748,3094,652.0,66.752967,80.862999,73.807983
6,Holden High School,248087,83.814988,83.803279,427,411,395,581.0,92.505855,96.252927,94.379391
7,Huang High School,1910635,81.182722,76.629414,2917,2372,1916,655.0,65.683922,81.316421,73.500171
8,Johnson High School,3094650,80.966394,77.072464,4761,3867,3145,650.0,66.057551,81.222432,73.639992
9,Pena High School,585858,84.044699,83.839917,962,923,910,609.0,94.594595,95.945946,95.270270
10,Rodriguez High School,2547363,80.744686,76.842711,3999,3208,2654,637.0,66.366592,80.220055,73.293323
11,Shelton High School,1056600,83.725724,83.359455,1761,1688,1653,600.0,93.867121,95.854628,94.860875
12,Thomas High School,1043130,83.848930,83.418349,1635,1591,1525,638.0,93.272171,97.308869,95.290520
13,Wilson High School,1319574,83.989488,83.274201,2283,2204,2143,578.0,93.867718,96.539641,95.203679
14,Wright High School,1049400,83.955000,83.682222,1800,1739,1680,583.0,93.333333,96.611111,94.972222

In [31]:
#Return a list of all of the columns in the new dataframe.

df_grouped.columns.tolist()

['school_name',
 'budget',
 'reading_score',
 'math_score',
 'size',
 'passing_reading',
 'passing_math',
 'Per_Student_Budget',
 'Pct_Passing_Math',
 'Pct_Passing_Reading',
 'Pct_Passing_Overall']

In [32]:
#Drop two columns in the dataframe that shows the number of students that pass either math or reading for readability

df_grouped.drop(['passing_reading', 'passing_math'], axis = 1, inplace = True)
df_grouped.columns

Index(['school_name', 'budget', 'reading_score', 'math_score', 'size',
       'Per_Student_Budget', 'Pct_Passing_Math', 'Pct_Passing_Reading',
       'Pct_Passing_Overall'],
      dtype='object')

### School Summary Data Frame (Deliverable 2)

In [33]:
#Complete a merge of the grouped dataframe and the schools to bring in the type of school (District or Charter) that
#each school belongs to.

#Presents the final dataframe.

df_final = df_grouped.merge(df_schoo11, on='school_name', how='left')
df_final.drop(['budget_x', 'size_x', 'School ID','size_y', 'budget_y'], axis = 1, inplace=True)
df_final

,school_name,reading_score,math_score,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,type
0,Bailey High School,81.033963,77.048432,628.0,66.680064,81.933280,74.306672,District
1,Cabrera High School,83.975780,83.061895,582.0,94.133477,97.039828,95.586652,Charter
2,Figueroa High School,81.158020,76.711767,639.0,65.988471,80.739234,73.363852,District
3,Ford High School,80.746258,77.102592,644.0,68.309602,79.299014,73.804308,District
4,Griffin High School,83.816757,83.351499,625.0,93.392371,97.138965,95.265668,Charter
5,Hernandez High School,80.934412,77.289752,652.0,66.752967,80.862999,73.807983,District
6,Holden High School,83.814988,83.803279,581.0,92.505855,96.252927,94.379391,Charter
7,Huang High School,81.182722,76.629414,655.0,65.683922,81.316421,73.500171,District
8,Johnson High School,80.966394,77.072464,650.0,66.057551,81.222432,73.639992,District
9,Pena High School,84.044699,83.839917,609.0,94.594595,95.945946,95.270270,Charter
10,Rodriguez High School,80.744686,76.842711,637.0,66.366592,80.220055,73.293323,District
11,Shelton High School,83.725724,83.359455,600.0,93.867121,95.854628,94.860875,Charter
12,Thomas High School,83.848930,83.418349,638.0,93.272171,97.308869,95.290520,Charter
13,Wilson High School,83.989488,83.274201,578.0,93.867718,96.539641,95.203679,Charter
14,Wright High School,83.955000,83.682222,583.0,93.333333,96.611111,94.972222,Charter

### Top Performing Schools (By Passing Rate)

Create a table that highlights the top 5 performing schools based on Overall Passing Rate. Include:

+ School Name
+ School Type
+ Total Students
+ Total School Budget
+ Per School Budget
+ Average Math Score
+ Average Reading Score
+ % Passing Math
+ % Passing Reading
+ Overall Passing Rate (Average of the above two)

### Top Performing Schools (By Passing Rate) Dataframe (Deliverable 3)

In [34]:
#Determine the top five schools that have the highest percent of students passing math and reading (overall passing rate)

df_final.sort_values(by='Pct_Passing_Overall', ascending=False).head(5)

,school_name,reading_score,math_score,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,type
1,Cabrera High School,83.975780,83.061895,582.0,94.133477,97.039828,95.586652,Charter
12,Thomas High School,83.848930,83.418349,638.0,93.272171,97.308869,95.290520,Charter
9,Pena High School,84.044699,83.839917,609.0,94.594595,95.945946,95.270270,Charter
4,Griffin High School,83.816757,83.351499,625.0,93.392371,97.138965,95.265668,Charter
13,Wilson High School,83.989488,83.274201,578.0,93.867718,96.539641,95.203679,Charter

### Top Performing Schools (By Passing Rate)

Create a table that highlights the bottom 5 performing schools based on Overall Passing Rate. Include all of the same metrics as above.

### Lowest Performing Schools (By Passing Rate) Dataframe (Deliverable 4)

In [35]:
#Determine the top five schools that have the lowest percent of students passing math and reading (overall passing rate)

df_final.sort_values(by='Pct_Passing_Overall', ascending=False).tail(5)

,school_name,reading_score,math_score,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,type
3,Ford High School,80.746258,77.102592,644.0,68.309602,79.299014,73.804308,District
8,Johnson High School,80.966394,77.072464,650.0,66.057551,81.222432,73.639992,District
7,Huang High School,81.182722,76.629414,655.0,65.683922,81.316421,73.500171,District
2,Figueroa High School,81.158020,76.711767,639.0,65.988471,80.739234,73.363852,District
10,Rodriguez High School,80.744686,76.842711,637.0,66.366592,80.220055,73.293323,District

### Math Scores by Grade

Create a table that lists the average Math Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

### Average Math Scores by Grade (Deliverable 5)

In [36]:
#Complete a groupby to determine the average math score of each school by grade level.

df_merge.groupby(['school_name', 'grade']).math_score.mean().unstack()

grade                       10th       11th       12th        9th
school_name
Bailey High School     76.996772  77.515588  76.492218  77.083676
Cabrera High School    83.154506  82.765560  83.277487  83.094697
Figueroa High School   76.539974  76.884344  77.151369  76.403037
Ford High School       77.672316  76.918058  76.179963  77.361345
Griffin High School    84.229064  83.842105  83.356164  82.044010
Hernandez High School  77.337408  77.136029  77.186567  77.438495
Holden High School     83.429825  85.000000  82.855422  83.787402
Huang High School      75.908735  76.446602  77.225641  77.027251
Johnson High School    76.691117  77.491653  76.863248  77.187857
Pena High School       83.372000  84.328125  84.121547  83.625455
Rodriguez High School  76.612500  76.395626  77.690748  76.859966
Shelton High School    82.917411  83.383495  83.778976  83.420755
Thomas High School     83.087886  83.498795  83.497041  83.590022
Wilson High School     83.724422  83.195326  83.035794  83.085578
Wright High School     84.010288  83.836782  83.644986  83.264706

### Reading Scores by Grade

Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

### Average Reading Scores by Grade (Deliverable 6)

In [37]:
#Complete a groupby to determine the average reading score of each school by grade level.

df_merge.groupby(['school_name','grade']).reading_score.mean().unstack()

grade                       10th       11th       12th        9th
school_name
Bailey High School     80.907183  80.945643  80.912451  81.303155
Cabrera High School    84.253219  83.788382  84.287958  83.676136
Figueroa High School   81.408912  80.640339  81.384863  81.198598
Ford High School       81.262712  80.403642  80.662338  80.632653
Griffin High School    83.706897  84.288089  84.013699  83.369193
Hernandez High School  80.660147  81.396140  80.857143  80.866860
Holden High School     83.324561  83.815534  84.698795  83.677165
Huang High School      81.512386  81.417476  80.305983  81.290284
Johnson High School    80.773431  80.616027  81.227564  81.260714
Pena High School       83.612000  84.335938  84.591160  83.807273
Rodriguez High School  80.629808  80.864811  80.376426  80.993127
Shelton High School    83.441964  84.373786  82.781671  84.122642
Thomas High School     84.254157  83.585542  83.831361  83.728850
Wilson High School     84.021452  83.764608  84.317673  83.939778
Wright High School     83.812757  84.156322  84.073171  83.833333

### Scores by School Spending

Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:

+ Average Math Score
+ Average Reading Score
+ % Passing Math
+ % Passing Reading
+ Overall Passing Rate (Average of the above two)

In [38]:
#Review the dataframe that has all of the merged data (schools and students)

df_merge.head()

,school_name,type,size,budget,name,gender,grade,reading_score,math_score,passing_reading,passing_math
0,Huang High School,District,2917,1910635,Paul Bradley,M,9th,66,79,0,1
1,Huang High School,District,2917,1910635,Victor Smith,M,12th,94,61,1,0
2,Huang High School,District,2917,1910635,Kevin Rodriguez,M,12th,90,60,1,0
3,Huang High School,District,2917,1910635,Dr. Richard Scott,M,12th,67,58,0,0
4,Huang High School,District,2917,1910635,Bonnie Ray,F,9th,97,84,1,1

In [39]:
#Add a new columns that calculats the money per student ratio.

df_merge['per_student_budget'] = df_merge['budget'] / df_merge['size']
df_merge.head()

,school_name,type,size,budget,name,gender,grade,reading_score,math_score,passing_reading,passing_math,per_student_budget
0,Huang High School,District,2917,1910635,Paul Bradley,M,9th,66,79,0,1,655.0
1,Huang High School,District,2917,1910635,Victor Smith,M,12th,94,61,1,0,655.0
2,Huang High School,District,2917,1910635,Kevin Rodriguez,M,12th,90,60,1,0,655.0
3,Huang High School,District,2917,1910635,Dr. Richard Scott,M,12th,67,58,0,0,655.0
4,Huang High School,District,2917,1910635,Bonnie Ray,F,9th,97,84,1,1,655.0

In [40]:
#Examine the summary stats of the per_studen_budget column to create bins needed for next analysis. 

df_merge.per_student_budget.describe()

count    39170.000000
mean       629.293541
std         25.034815
min        578.000000
25%        625.000000
50%        638.000000
75%        650.000000
max        655.000000
Name: per_student_budget, dtype: float64

In [41]:
#Create bin names and numerical ranges for the binnning.

bins = [578, 625, 638, 650 ,700]
bin_names = ['Low', 'Below Average', 'Above Average', 'High']

In [42]:
#Bin (categorize) the data in the dataframe and return the head.

df_merge['budget_binned'] = pd.cut(df_merge['per_student_budget'], bins, labels = bin_names)
df_merge.head()

,school_name,type,size,budget,name,gender,grade,reading_score,math_score,passing_reading,passing_math,per_student_budget,budget_binned
0,Huang High School,District,2917,1910635,Paul Bradley,M,9th,66,79,0,1,655.0,High
1,Huang High School,District,2917,1910635,Victor Smith,M,12th,94,61,1,0,655.0,High
2,Huang High School,District,2917,1910635,Kevin Rodriguez,M,12th,90,60,1,0,655.0,High
3,Huang High School,District,2917,1910635,Dr. Richard Scott,M,12th,67,58,0,0,655.0,High
4,Huang High School,District,2917,1910635,Bonnie Ray,F,9th,97,84,1,1,655.0,High

In [43]:
#Define a dictionary with the numpy functions needed for the groupby that will be completed in the next step.

agg_function = {'budget':np.mean, 'reading_score':np.mean, 'math_score': np.mean, 'size': np.mean, 'passing_reading': np.sum, 'passing_math': np.sum}

### Scores by School Spending (Deliverable 7)

In [44]:
#Join the data frames and create a new column that determines the size of the budget.

#Complete a groupby of the merged dataframe and apply certain (different) numpy functions to the columns
df_grouped = df_merge.groupby(['school_name', 'budget_binned'], as_index = False).agg(agg_function)

#Define the budget per student column based on the budget of each school and the number of students at each school.
df_grouped['Per_Student_Budget'] = df_grouped['budget'] / df_grouped['size']

#Define the column that calcualtes the percent of students that pass math at each school.
df_grouped['Pct_Passing_Math'] = 100 * (df_grouped['passing_math'] / df_grouped['size']) 

#Define the column that calcualtes the percent of students that pass reading at each school.
df_grouped['Pct_Passing_Reading'] = 100 * (df_grouped['passing_reading'] / df_grouped['size']) 

#Define the column that calcualtes the percent of students that pass math and reading at each school.
df_grouped['Pct_Passing_Overall'] = (df_grouped['Pct_Passing_Reading'] + df_grouped['Pct_Passing_Math']) / 2

#df_grouped.drop(['passing_reading', 'passing_math'], axis = 1, inplace = True)

#Return the new dataframe.
df_grouped

,school_name,budget_binned,budget,reading_score,math_score,size,passing_reading,passing_math,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall
0,Bailey High School,Below Average,3124928,81.033963,77.048432,4976,4077,3318,628.0,66.680064,81.933280,74.306672
1,Cabrera High School,Low,1081356,83.975780,83.061895,1858,1803,1749,582.0,94.133477,97.039828,95.586652
2,Figueroa High School,Above Average,1884411,81.158020,76.711767,2949,2381,1946,639.0,65.988471,80.739234,73.363852
3,Ford High School,Above Average,1763916,80.746258,77.102592,2739,2172,1871,644.0,68.309602,79.299014,73.804308
4,Griffin High School,Low,917500,83.816757,83.351499,1468,1426,1371,625.0,93.392371,97.138965,95.265668
5,Hernandez High School,High,3022020,80.934412,77.289752,4635,3748,3094,652.0,66.752967,80.862999,73.807983
6,Holden High School,Low,248087,83.814988,83.803279,427,411,395,581.0,92.505855,96.252927,94.379391
7,Huang High School,High,1910635,81.182722,76.629414,2917,2372,1916,655.0,65.683922,81.316421,73.500171
8,Johnson High School,Above Average,3094650,80.966394,77.072464,4761,3867,3145,650.0,66.057551,81.222432,73.639992
9,Pena High School,Low,585858,84.044699,83.839917,962,923,910,609.0,94.594595,95.945946,95.270270
10,Rodriguez High School,Below Average,2547363,80.744686,76.842711,3999,3208,2654,637.0,66.366592,80.220055,73.293323
11,Shelton High School,Low,1056600,83.725724,83.359455,1761,1688,1653,600.0,93.867121,95.854628,94.860875
12,Thomas High School,Below Average,1043130,83.848930,83.418349,1635,1591,1525,638.0,93.272171,97.308869,95.290520
13,Wright High School,Low,1049400,83.955000,83.682222,1800,1739,1680,583.0,93.333333,96.611111,94.972222

In [45]:
agg_function = {'budget': np.mean, 'reading_score':np.mean, 'math_score': np.mean, 'size': np.sum, 'passing_reading': np.sum, 'passing_math': np.sum}
df_bin_grouped = df_grouped.groupby(['budget_binned'], as_index = False).agg(agg_function)
df_bin_grouped['Per_Student_Budget'] = df_bin_grouped['budget'] / df_bin_grouped['size']
df_bin_grouped['Pct_Passing_Math'] = 100 * (df_bin_grouped['passing_math'] / df_bin_grouped['size']) 
df_bin_grouped['Pct_Passing_Reading'] = 100 * (df_bin_grouped['passing_reading'] / df_bin_grouped['size']) 
df_bin_grouped['Pct_Passing_Overall'] = (df_bin_grouped['Pct_Passing_Reading'] + df_bin_grouped['Pct_Passing_Math']) / 2
df_bin_grouped.drop(['passing_reading', 'passing_math'], axis = 1, inplace = True)
df_bin_grouped

,budget_binned,budget,reading_score,math_score,size,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall
0,Low,8.231335e+05,83.888825,83.516378,8276,99.460307,93.740938,96.544224,95.142581
1,Below Average,2.238474e+06,81.875860,79.103164,10610,210.977725,70.659755,83.656927,77.158341
2,Above Average,2.247659e+06,80.956890,76.962274,10449,215.107570,66.628385,80.581874,73.605130
3,High,2.466328e+06,81.058567,76.959583,7552,326.579383,66.340042,81.038136,73.689089

### Scores by School Size (Deliverable 8)

+ Repeat the above breakdown, but this time group schools based on a reasonable approximation of school size (Small, Medium, Large).

In [46]:
#Determine summary statistics for the school dataframe

df_schools.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [47]:
#Define bin range and labels.

bins = [400, 2000, 3500, 5000]
bin_names = ['Small', 'Medium', 'Large']

#Bin the data in the dataframe and return the values to a new column.
df_grouped['size_bins'] = pd.cut(df_grouped['size'], bins, labels = bin_names)

#Return the first five rows in the dataframe.
df_grouped.head()

,school_name,budget_binned,budget,reading_score,math_score,size,passing_reading,passing_math,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall,size_bins
0,Bailey High School,Below Average,3124928,81.033963,77.048432,4976,4077,3318,628.0,66.680064,81.933280,74.306672,Large
1,Cabrera High School,Low,1081356,83.975780,83.061895,1858,1803,1749,582.0,94.133477,97.039828,95.586652,Small
2,Figueroa High School,Above Average,1884411,81.158020,76.711767,2949,2381,1946,639.0,65.988471,80.739234,73.363852,Medium
3,Ford High School,Above Average,1763916,80.746258,77.102592,2739,2172,1871,644.0,68.309602,79.299014,73.804308,Medium
4,Griffin High School,Low,917500,83.816757,83.351499,1468,1426,1371,625.0,93.392371,97.138965,95.265668,Small

### Scores by School Size Data Frame (Deliverable 8)

In [48]:
#Define the functions that will be used in the groupby method.
agg_function = {'budget': np.sum, 'reading_score':np.mean, 'math_score': np.mean, 'size': np.sum, 'passing_reading': np.sum, 'passing_math': np.sum}

#Perform the groupby and return the data as groups based on the bin labels.  The index is also reset.
df_bin_grouped = df_grouped.groupby(['size_bins'], as_index = False).agg(agg_function)

#Define a new column that is the spending per student based on the data in the new grouped dataframe.
df_bin_grouped['Per_Student_Budget'] = df_bin_grouped['budget'] / df_bin_grouped['size']

#Define a new column that calcualtes the percetage of students who pass math.
df_bin_grouped['Pct_Passing_Math'] = 100 * (df_bin_grouped['passing_math'] / df_bin_grouped['size']) 

#Define a new column that calcualtes the percetage of students who pass reading.
df_bin_grouped['Pct_Passing_Reading'] = 100 * (df_bin_grouped['passing_reading'] / df_bin_grouped['size']) 

#Define a new column that calcualtes the percetage of students who pass math or reading.
df_bin_grouped['Pct_Passing_Overall'] = (df_bin_grouped['Pct_Passing_Reading'] + df_bin_grouped['Pct_Passing_Math']) / 2
# df_bin_grouped.drop(['passing_reading', 'passing_math'], axis = 1, inplace = True)

#Return the new dataframe. 
df_bin_grouped

,size_bins,budget,reading_score,math_score,size,passing_reading,passing_math,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall
0,Small,5981931,83.883125,83.502373,9911,9581,9283,603.564827,93.663606,96.670366,95.166986
1,Medium,5558962,81.029000,76.814591,8605,6925,5733,646.015340,66.624056,80.476467,73.550261
2,Large,11788961,80.919864,77.063340,18371,14900,12211,641.715802,66.468891,81.106091,73.787491

### Scores by School Type (Deliverable 9)

+ Repeat the above breakdown, but this time group schools based on school type (Charter vs. District).

In [49]:
#Define the functions that will be used in the groupby method.
agg_function = {'budget': np.sum, 'reading_score': np.mean, 'math_score': np.mean, 'size': np.sum, 'passing_reading': np.sum, 'passing_math': np.sum}

#Perform the groupby and return the data as groups based on the type of school.  The index is also reset.
df_type = df_merge.groupby('type', as_index = False).agg(agg_function)

#Drop two columns for readability
df_type.drop(['budget', 'size'], axis = 1, inplace = True)

#Return the new dataframe
df_type

       type  reading_score  math_score  passing_reading  passing_math
0   Charter      83.902821   83.406183            11785         11426
1  District      80.962485   76.987026            21825         17944

### Scores by School Type Data Frame (Deliverable 9)

In [50]:
#Create final dataframe

#Select columns from an existing dataframe and send to a new dataframe
df3 = df_schools[['size', 'type', 'budget']]

#Perform a groupby on the new dataframe
df4 = df3.groupby('type', as_index=False).sum()

#Merge the new grouped dataframe with the dataframe previously created showing the stats by school type
final_df = pd.merge(df4, df_type, on='type', how='inner')

#Define a new column that calculats the budget per student based on the data in the data frame
final_df['Per_Student_Budget'] = final_df['budget'] / final_df['size']

#Define a new column that calculats the percent of students that passed math
final_df['Pct_Passing_Math'] = 100 * (final_df['passing_math'] / final_df['size']) 

#Define a new column that calculats the percent of students that passed reading
final_df['Pct_Passing_Reading'] = 100 * (final_df['passing_reading'] / final_df['size']) 

#Define a new column that calculats the percent of students that passed math or reading
final_df['Pct_Passing_Overall'] = (final_df['Pct_Passing_Reading'] + final_df['Pct_Passing_Math']) / 2

# df_bin_grouped.drop(['passing_reading', 'passing_math'], axis = 1, inplace = True)

#Return final dataframe.
final_df

,type,size,budget,reading_score,math_score,passing_reading,passing_math,Per_Student_Budget,Pct_Passing_Math,Pct_Passing_Reading,Pct_Passing_Overall
0,Charter,12194,7301505,83.902821,83.406183,11785,11426,598.778498,93.701821,96.645891,95.173856
1,District,26976,17347923,80.962485,76.987026,21825,17944,643.087300,66.518387,80.905249,73.711818

GTA (2017-12-01)